Revit 2018 API
AssetPropertyDoubleArray4d.GetValueAsDoubles Method
 Get the value property as doubles.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.0)
Syntax
C#
public IList<double> GetValueAsDoubles()
Visual Basic
Public Function GetValueAsDoubles As IList(Of Double)
Visual C++
public:
IList<double>^ GetValueAsDoubles()
See Also
AssetPropertyDoubleArray4d Class
Autodesk.Revit.DB.Visual Namespace